{
    "projects": [
        {
            "shortname": "celltable",
            "title": "CellTable and Retinal Ganglion Cell Type Analysis",
            "category": "science",
            "short_description": "A neural data handling platform for large-scale retinal recordings.",
            "long_description": "A neural data handling platform package written in Python for the Chichilnisky Lab at Stanford. This lab has a recording data archive of hundreds of terabytes of data, previously only accessible slowly and with a cumbersome library, and only in short partial records. The CellTable creates large Pandas tables of neural data and second-level analysis features, combined across hours of continuous recordings, for approximately a thousand neurons per recording. Features include spatial and temporal analyses from the linear-nonlinear visual response model, spike correlations, mosaic analysis, and more. Recordings are summarized as \"median cells\" which enabled an across-dataset analysis of cell type variability.",
            "hyperlink": "https://www.biorxiv.org/content/10.1101/2024.10.31.621339v1"
        },
        {
            "shortname": "lucida",
            "title": "Lucida GUI",
            "category": "science",
            "short_description": "An interactive GUI for data exploration on top of the CellTable platform.",
            "long_description": "This GUI lives on top of the CellTable core platform, enabling interactive data exploration and analysis. Focused on machine learning-aided cell type classification, with clickable groups generated by dimensionality reduction and clustering algorithms. Conveniently arranges and sorts cells for rapid identification and fixing of data problems and errors.",
            "hyperlink": null
        },
        {
            "shortname": "neural_network_models",
            "title": "Neural Network Visual Response Models",
            "category": "science",
            "short_description": "Shallow convolutional neural networks for modeling retinal ganglion cell responses.",
            "long_description": "Developed and trained shallow convolutional neural networks to model retinal ganglion cells responses to natural scene movies and white noise in the human and macaque monkey. Explored hyperparameter space and created models with 20-30 percent improvement over the best linear-nonlinear models. Followed the path started by the DeepRetina project in the Baccus Lab at Stanford.",
            "hyperlink": "https://www.biorxiv.org/content/10.1101/2024.03.22.586353v1"
        },
        {
            "shortname": "light_curve",
            "title": "Light Curve",
            "category": "art",
            "short_description": "An interactive flame effect installation with 30 controlled propane flames.",
            "long_description": "Features 30 independently proportionally controlled propane flames (the most on any piece ever), mounted 15 feet up on a 2D gimbaled pendulum, which swings around by participant control. A custom Python and Arduino software platform renders patterns into 3D geometry, creating motor and solenoid commands transmitted wirelessly to the piece. Created in 2024, this piece pushed my skills in project management, handling large heavy art, plumbing design, fundraising, etc. Features over 400 feet of hand shaped and flare terminated copper tubing!",
            "hyperlink": null
        },
        {
            "shortname": "dancing_forest",
            "title": "The Dancing Forest",
            "category": "art",
            "short_description": "A playful interactive kinetic installation with vertical poles and LEDs.",
            "long_description": "A field of 19 vertical steel poles, connected to the ground in a triangular grid with swivel joints and to each other at the top with elastic cords. Participants dance, lean, swing, sway, balance, and play with the poles, and through them and the web, each other. Strong enough to handle a dozen people playing at the same time. Features a custom PCB with an ESP32, accelerometer, and dozens of LEDs within a custom PETG printed housing at the top of each pole, in a complex module that enables pole rotation. LiPo batteries are housed within the poles.",
            "hyperlink": null
        },
        {
            "shortname": "fantasmophone",
            "title": "Fantasmophone",
            "category": "art",
            "short_description": "A silly fun interactive sound sculpture with LEDs and a surrounding array of speakers.",
            "long_description": "A large interactive sound sculpture",
            "hyperlink": null
        },
        {
            "shortname": "fmini_gap_junctions",
            "title": "F-mini ON and OFF Gap Junctions",
            "category": "science",
            "short_description": "Discovered a connection between two types of retinal ganglion cells in the mouse.",
            "long_description": "In the vertebrate retina, the location of a neuron’s receptive field (RF) in visual space closely corresponds to the physical location of synaptic input onto its dendrites, a relationship called the retinotopic map. We report the discovery of a systematic spatial offset between the ON and OFF receptive subfields in F-mini-ON retinal ganglion cells (RGCs). Surprisingly, this property does not come from spatially-offset ON and OFF layer dendrites, but instead arises from a network of electrical synapses via gap junctions to RGCs of a different type, the F-mini-OFF. We show that the asymmetric morphology and connectivity of these RGCs can explain their RF offset, and we use a multi-cell model to explore the effects of receptive field offset on the precision of edge location representation in a population. This RGC network forms a novel electrical channel combining the ON and OFF feed-forward pathways within the output layer of the retina.",
            "hyperlink": null
        },
        {
            "shortname": "mouse_rgc_classification",
            "title": "Classification of the Mouse Retinal Ganglion Cells",
            "category": "science",
            "short_description": "Created the current standard atlas of mouse RGC types with electrophysiology and computation.",
            "long_description": "Investigated mouse RGC types using single-cell electrophysiology and computational classification of 1700 neurons over several years. Created an interactive website enabling researchers to study these cell types and use them for their research, with a small team. The resulting paper is the current standard atlas of mouse RGC types.",
            "hyperlink": null
        },
        {
            "shortname": "full_duplex",
            "title": "Full Duplex Wireless Communication",
            "category": "engineering",
            "short_description": "Developed a full-duplex wireless communication system for wireless transmission.",
            "long_description": "Developed a full-duplex wireless communication system for wireless transmission. This system uses a single antenna for both transmission and reception, enabling simultaneous transmission and reception on the same frequency. This system is based on a novel RF circulator design that enables full-duplex communication with a single antenna. This system has been demonstrated to achieve full-duplex communication with a single antenna, enabling simultaneous transmission and reception on the same frequency.",
            "hyperlink": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=021b75406a5d995e08dcab21fd3d742e223b805d"
        },
        {
            "shortname": "log_analysis",
            "title": "Modem Log Analysis",
            "category": "engineering",
            "short_description": "Developed a system for analyzing modem logs",
            "long_description": "At Qualcomm, Inc, developed a software platform in Python for analyzing wireless modem logs to identify and diagnose problems.",
            "hyperlink": null
        },
        {
            "shortname": "chandelier",
            "title": "Chandelier",
            "category": "art",
            "short_description": "A pleasant light art piece inspired by lights moving through a dense forest.",
            "long_description": "Inspired by the visual effect of lights moving through a dense forest, creating colored shadows of many depths and layers. A clever pleasant light art piece featuring tensegrity-suspended copper tubes and high-density LED strips running custom pattern generation code.",
            "hyperlink": null
        },
        {
            "shortname": "seraph_sundial",
            "title": "Seraph Sundial",
            "category": "art",
            "short_description": "A magical 24-hour sundial with LEDs that replace the sun at night.",
            "long_description": "Using infrared proximity sensors to track hands and react to participant presence and motion, this sundial replaces the sun with LEDs at night. A Raspberry Pi with custom rendering code generates beautiful patterns in response.",
            "hyperlink": null
        },
        {
            "shortname": "flaming_lotus_girls",
            "title": "Large-scale Installations with the Flaming Lotus Girls",
            "category": "art",
            "short_description": "Collaborated on large flame and LED art installations with the Flaming Lotus Girls.",
            "long_description": "Led and worked with teams to create very large installation pieces featuring world-class interactive flame effects and sculptural elements. Focused on the electronics aspects, developing network LED displays and flame effect control systems.",
            "hyperlink": null
        },
        {
            "shortname": "jewelry",
            "title": "Jewelry",
            "category": "art",
            "short_description": "Designed and sold silver and gemstone jewelry pieces.",
            "long_description": "Over several years created a series of several dozen sculptural jewelry pieces in silver and gemstones. Ran a short-lived Etsy store and sold a few pieces online and to friends.",
            "hyperlink": null
        }
    ]
}
